RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_adc.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_adc.c
 **
 ** A detailed description is available at
 ** @link AdcGroup Adc description @endlink
 **
 **   - 2018-11-30  CDT First version for Device Driver Library of Adc.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_adc.h"
#include "hc32f460_utility.h"

#if (DDL_ADC_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup AdcGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*! Parameter validity check for ADC peripherals. */
#define IS_ADC_PERIPH(ADCx)                                                     \
(   ((ADCx) == M4_ADC1)                         ||                              \
    ((ADCx) == M4_ADC2))

/*! Parameter validity check for ADC1 channel index. */
#define IS_ADC1_CH_INDEX(x)                                                     \
(   ((x) < ADC1_CH_COUNT))

/*! Parameter validity check for ADC2 channel index. */
#define IS_ADC2_CH_INDEX(x)                                                     \
(   ((x) < ADC2_CH_COUNT))

/*! Parameter validity check for ADC average count. */
#define IS_ADC_AVCNT(AVCNT)                                                     \
(   ((AVCNT) == AdcAvcnt_2)                     ||                              \
    (((AVCNT) >= AdcAvcnt_4) && ((AVCNT) <= AdcAvcnt_256)))

/*! Parameter validity check for ADC data alignment. */
#define IS_ADC_DATA_ALIGN(ALIGN)                                                \
(   ((ALIGN) == AdcDataAlign_Right)             ||                              \
    ((ALIGN) == AdcDataAlign_Left))

/*! Parameter validity check for ADC auto clear DR. */
#define IS_ADC_CLREN(EN)                                                        \
(   ((EN) == AdcClren_Enable)                   ||                              \
    ((EN) == AdcClren_Disable))

/*! Parameter validity check for ADC resolution. */
#define IS_ADC_RESOLUTION(RESOLUTION)                                           \
(   ((RESOLUTION) == AdcResolution_8Bit)        ||                              \
    ((RESOLUTION) == AdcResolution_10Bit)       ||                              \
    ((RESOLUTION) == AdcResolution_12Bit))

/*! Parameter validity check for ADC scan convert mode. */
#define IS_ADC_SCAN_MODE(MODE)                                                  \
(   ((MODE) == AdcMode_SAOnce)                  ||                              \
    ((MODE) == AdcMode_SAContinuous)            ||                              \
    ((MODE) == AdcMode_SAOnceSBOnce)            ||                              \
    ((MODE) == AdcMode_SAContinuousSBOnce))

/*! Parameter validity check for ADC RSCHSEL. */
#define IS_ADC_RSCHSEL(SEL)                                                     \
(   ((SEL) == AdcRschsel_Continue)              ||                              \
    ((SEL) == AdcRschsel_Restart))

/*! Parameter validity check for ADC SA trigger source. */
#define IS_ADC_TRGEN(EN)                                                        \
(   ((EN) == AdcTrgen_Enable)                   ||                              \
    ((EN) == AdcTrgen_Disable))

/*! Parameter validity check for ADC SA trigger source. */
#define IS_ADC_TRGSEL(SEL)                                                      \
(   ((SEL) == AdcTrgsel_ADTRGX)                 ||                              \
    ((SEL) == AdcTrgsel_TRGX0)                  ||                              \
    ((SEL) == AdcTrgsel_TRGX1)                  ||                              \
    ((SEL) == AdcTrgsel_TRGX0_TRGX1))

/*! Parameter validity check for ADC common trigger. */
#define IS_ADC_COM_TRIGGER(x)                                                   \
(   ((x) == AdcComTrigger_1)                    ||                              \
    ((x) == AdcComTrigger_2)                    ||                              \
    ((x) == AdcComTrigger_1_2))

/*! Parameter validity check for ADC EOCAIEN/ENCBIEN. */
#define IS_ADC_EOCIEN(EN)                                                       \
(   ((EN) == AdcEocien_Disable)                 ||                              \
    ((EN) == AdcEocien_Enable))

/*! Parameter validity check for ADC sampling time. */
#define IS_ADC_SAMPLE_TIME(TIME)                                                \
(   ((TIME) == 255u)                            ||                              \
    (((TIME) >= 5u) && ((TIME) <= 254u)))

/*! Parameter validity check for ADC sync trigger mode. */
#define IS_ADC_SYNC_MODE(MODE)                                                  \
(   ((MODE) == AdcSync_SingleSerial)            ||                              \
    ((MODE) == AdcSync_SingleParallel)          ||                              \
    ((MODE) == AdcSync_ContinuousSerial)        ||                              \
    ((MODE) == AdcSync_ContinuousParallel))

