RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_adc.c
            if ((pstcTrgCfg->enTrgSel & AdcTrgsel_TRGX0) == AdcTrgsel_TRGX0)
            {
                DDL_ASSERT(IS_ADC_TRIG_SRC_EVENT(pstcTrgCfg->enInTrg0));

                u32TrgSelR  = *io32AdcxTrgSelR0;
                u32TrgSelR &= ~0x1FFul;
                u32TrgSelR |= pstcTrgCfg->enInTrg0;
                *io32AdcxTrgSelR0 = u32TrgSelR;
            }
            if ((pstcTrgCfg->enTrgSel & AdcTrgsel_TRGX1) == AdcTrgsel_TRGX1)
            {
                DDL_ASSERT(IS_ADC_TRIG_SRC_EVENT(pstcTrgCfg->enInTrg1));

                u32TrgSelR  = *io32AdcxTrgSelR1;
                u32TrgSelR &= ~0x1FFul;
                u32TrgSelR |= pstcTrgCfg->enInTrg1;
                *io32AdcxTrgSelR1 = u32TrgSelR;
            }
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set trigger source.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u8Seq                   The sequence which you want to set it's trigger source.
 **
 ** \param [in] enState                 Enable or disable trigger source.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_TriggerSrcCmd(M4_ADC_TypeDef *ADCx,
                              uint8_t u8Seq,
                              en_functional_state_t enState)
{
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != ADCx) && (u8Seq <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

        if (ADC_SEQ_A == u8Seq)
        {
            ADCx->TRGSR_f.TRGENA = enState;
        }
        else
        {
            ADCx->TRGSR_f.TRGENB = enState;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable ADC common trigger.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] enTrgSel                ADC trigger source type. See @ref en_adc_trgsel_t for details.
 **
 ** \param [in] enComTrigger            ADC common trigger selection. See @ref en_adc_com_trigger_t for details.
 **
 ** \param [in] enState                 Enable or disable the specified common trigger.
 **
 ** \retval None.
 **
 ******************************************************************************/
void ADC_ComTriggerCmd(M4_ADC_TypeDef *ADCx, en_adc_trgsel_t enTrgSel, \
                       en_adc_com_trigger_t enComTrigger, en_functional_state_t enState)
{
    uint32_t u32ComTrig = enComTrigger;
    uint32_t u32ITRGSELRAddr;

    DDL_ASSERT(IS_ADC_PERIPH(ADCx));
    DDL_ASSERT(IS_ADC_TRGSEL(enTrgSel) && (enTrgSel != AdcTrgsel_ADTRGX));
    DDL_ASSERT(IS_ADC_COM_TRIGGER(enComTrigger));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

    if (M4_ADC1 == ADCx)
    {
        u32ITRGSELRAddr = (uint32_t)&M4_AOS->ADC1_ITRGSELR0;
    }
    else
    {
        u32ITRGSELRAddr = (uint32_t)&M4_AOS->ADC2_ITRGSELR0;
    }

    u32ComTrig <<= 30u;

    if ((enTrgSel & AdcTrgsel_TRGX0) == AdcTrgsel_TRGX0)
    {
        if (enState == Enable)
        {
            *(__IO uint32_t *)u32ITRGSELRAddr |= u32ComTrig;
        }
        else
        {
            *(__IO uint32_t *)u32ITRGSELRAddr &= ~u32ComTrig;
        }
    }

    if ((enTrgSel & AdcTrgsel_TRGX1) == AdcTrgsel_TRGX1)
    {
        u32ITRGSELRAddr += 4ul;
        if (enState == Enable)
        {
            *(__IO uint32_t *)u32ITRGSELRAddr |= u32ComTrig;
        }
        else
        {
            *(__IO uint32_t *)u32ITRGSELRAddr &= ~u32ComTrig;
        }
    }
}

/**
 *******************************************************************************
 ** \brief Add ADC channel.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] pstcChCfg               Pointer to ADC channel configuration structure.
 ** \arg u32Channel                     The channel(s) you want to configure.
 ** \arg u8Sequence                     The sequence which the channel(s) belong(s) to.
 ** \arg pu8SampTime                    Pointer to sampling time.
 **                                     eg. u32Channel = 1001b
 **                                     pu8SampTime[0] = channel 0's time
 **                                     pu8SampTime[1] = channel 3's time
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 ** \note Sequence A and Sequence B CAN NOT set the same channel!!!
 **
 ******************************************************************************/
en_result_t ADC_AddAdcChannel(M4_ADC_TypeDef *ADCx, const stc_adc_ch_cfg_t *pstcChCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint8_t      i;
    uint8_t      j;
    uint32_t     u32ChannelSel;
    __IO uint8_t *io8Sstr;

    if ((NULL != ADCx)      &&
        (NULL != pstcChCfg) &&
        (pstcChCfg->u8Sequence <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        if (M4_ADC1 == ADCx)
        {
            u32ChannelSel = pstcChCfg->u32Channel & ADC1_CH_ALL;
            if (ADC_SEQ_A == pstcChCfg->u8Sequence)
            {
                ADCx->CHSELRA0 |= (uint16_t)u32ChannelSel;
                ADCx->CHSELRA1 |= (uint16_t)(u32ChannelSel >> 16u);
            }
            else
            {
                ADCx->CHSELRB0 |= (uint16_t)u32ChannelSel;
                ADCx->CHSELRB1 |= (uint16_t)(u32ChannelSel >> 16u);
            }
        }
        else
        {
            u32ChannelSel = pstcChCfg->u32Channel & ADC2_CH_ALL;
            if (ADC_SEQ_A == pstcChCfg->u8Sequence)
            {
                ADCx->CHSELRA0 |= (uint16_t)u32ChannelSel;
            }
            else
            {
                ADCx->CHSELRB0 |= (uint16_t)u32ChannelSel;
            }
        }

