RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_adc.c
        /* Set sampling time */
        i = 0u;
        j = 0u;
        io8Sstr = &(ADCx->SSTR0);
        while (0u != u32ChannelSel)
        {
            if (u32ChannelSel & 0x1ul)
            {
                io8Sstr[i] = pstcChCfg->pu8SampTime[j++];
            }
            u32ChannelSel >>= 1u;
            i++;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Delete ADC channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32Channel              The channel(s) you want to delete.
 ** \arg ADC1_CH0 ~ ADC1_CH16
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ** \note                               You can use this function to delete ADC channel(s)
 **                                     and then set the corresponding pin(s) of the channel(s)
 **                                     to the other mode you need in your application.
 **
 ******************************************************************************/
en_result_t ADC_DelAdcChannel(M4_ADC_TypeDef *ADCx, uint32_t u32Channel)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t    u16ChSelR0;
    uint16_t    u16ChSelR1;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        u16ChSelR0 = (uint16_t)u32Channel;
        u16ChSelR1 = (uint16_t)(u32Channel >> 16u);

        ADCx->CHSELRA0 &= (uint16_t)(~u16ChSelR0);
        ADCx->CHSELRB0 &= (uint16_t)(~u16ChSelR0);

        if (M4_ADC1 == ADCx)
        {
            ADCx->CHSELRA1 &= (uint16_t)(~u16ChSelR1);
            ADCx->CHSELRB1 &= (uint16_t)(~u16ChSelR1);
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief ADC interrupt configuration.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u8Seq                   The sequence to be configured.
 **
 ** \param [in] enState                 Enable or Disable sequence conversion done interrupt.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_SeqITCmd(M4_ADC_TypeDef *ADCx,
                         uint8_t u8Seq,
                         en_functional_state_t enState)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint8_t u8Msk = 0u;

    if ((NULL != ADCx) && (u8Seq <= ADC_SEQ_B))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

        u8Msk = (uint8_t)(0x1ul << u8Seq);
        ADCx->ISR &= (uint8_t)(~u8Msk);

        if (Enable == enState)
        {
            ADCx->ICR |= u8Msk;
        }
        else
        {
            ADCx->ICR &= (uint8_t)(~u8Msk);
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief ADC average conversion configuration.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] enAvgCnt                Average after enAvgCnt conversions.
 **                                     See @ref en_adc_avcnt_t for details.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_ConfigAvg(M4_ADC_TypeDef *ADCx, en_adc_avcnt_t enAvgCnt)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_ADC_AVCNT(enAvgCnt));

        ADCx->CR0_f.AVCNT = enAvgCnt;
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Add average channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32Channel              The channel(s), which will be set as average channel(s).
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ** \note                               The channel must first be configured as an analog channel
 **                                     by function ADC_AddAdcChannel.
 **
 ******************************************************************************/
en_result_t ADC_AddAvgChannel(M4_ADC_TypeDef *ADCx, uint32_t u32Channel)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16AvgChR0;
    uint16_t u16AvgChR1;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        if (M4_ADC1 == ADCx)
        {
            u32Channel &= ADC1_CH_ALL;
        }
        else
        {
            u32Channel &= ADC2_CH_ALL;
        }

        u16AvgChR0 = (uint16_t)u32Channel;
        u16AvgChR1 = (uint16_t)(u32Channel >> 16u);

        ADCx->AVCHSELR0 |= u16AvgChR0;
        if (M4_ADC1 == ADCx)
        {
            ADCx->AVCHSELR1 |= u16AvgChR1;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Delete average channel(s).
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] u32Channel              The average channel(s) which you want to delete.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_DelAvgChannel(M4_ADC_TypeDef *ADCx, uint32_t u32Channel)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint16_t u16AvgChR0;
    uint16_t u16AvgChR1;

    if (NULL != ADCx)
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));

        u16AvgChR0 = (uint16_t)u32Channel;
        u16AvgChR1 = (uint16_t)(u32Channel >> 16u);

        ADCx->AVCHSELR0 &= (uint16_t)(~u16AvgChR0);
        if (M4_ADC1 == ADCx)
        {
            ADCx->AVCHSELR1 &= (uint16_t)(~u16AvgChR1);
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief ADC AWD(analog watch dog) configuration.
 **
 ** \param [in] ADCx                    Pointer to ADC instance register base.
 ** \arg M4_ADC1                        ADC unit 1 instance register base.
 ** \arg M4_ADC2                        ADC unit 2 instance register base.
 **
 ** \param [in] pstcAwdCfg              Pointer to the configuration structure.
 **                                     See @ref stc_adc_awd_cfg_t for details.
 **
 ** \retval ErrorInvalidParameter       Parameter error.
 ** \retval Ok                          No error occurred.
 **
 ******************************************************************************/
en_result_t ADC_ConfigAwd(M4_ADC_TypeDef *ADCx, const stc_adc_awd_cfg_t *pstcAwdCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if ((NULL != ADCx) && (NULL != pstcAwdCfg))
    {
        DDL_ASSERT(IS_ADC_PERIPH(ADCx));
        DDL_ASSERT(IS_ADC_AWDMD(pstcAwdCfg->enAwdmd));
        DDL_ASSERT(IS_ADC_AWDSS(pstcAwdCfg->enAwdss));

        ADCx->AWDCR_f.AWDEN  = AdcAwd_Disable;
        ADCx->AWDCR_f.AWDIEN = AdcAwdInt_Disable;
        ADCx->AWDCR_f.AWDMD  = pstcAwdCfg->enAwdmd;
        ADCx->AWDCR_f.AWDSS  = pstcAwdCfg->enAwdss;

        ADCx->AWDDR0 = pstcAwdCfg->u16AwdDr0;
        ADCx->AWDDR1 = pstcAwdCfg->u16AwdDr1;

